data = "ΜπαΜπα ΤσαΝτα ΝταΤσα ΓκαΤσα ΜπαΜπα ΓκαΓκα ΤσαΝτα ΝταΓκα ΝταΝτα ΝταΝτα ΜπαΜπα ΤσαΓκα ΤσαΝτα ΝταΝτα ΜπαΜπα ΤσαΜπα ΜπαΝτα ΝταΤσα ΤσαΜπα ΜπαΓκα ΓκαΤσα ΝταΝτα ΓκαΝτα ΝταΝτα ΝταΜπα ΜπαΤσα ΓκαΤσα ΝταΝτα ΝταΜπα ΜπαΤσα"
data = "ΜπαΜπα ΤσαΝτα ΝταΤσα ΓκαΤσα ΜπαΜπα ΓκαΓκα ΤσαΝτα ΝταΓκα ΝταΝτα ΝταΜπα ΝταΜπα ΤσαΓκα ΤσαΝτα ΝταΝτα ΜπαΤσα ΜπαΜπα ΜπαΝτα ΝταΤσα ΤσαΜπα ΜπαΓκα ΓκαΤσα ΝταΝτα ΓκαΝτα ΝταΝτα ΝταΜπα ΜπαΤσα ΓκαΤσα ΝταΝτα ΝταΜπα ΜπαΤσα"
data = data.split()

d = dict()

for item in data:
    if item in d:
        d[item] += 1
    else:
        d[item] = 1

for k, v in d.items():
    print(k, v)
